# Student Attendance Project

### importing necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Reading the csv file.

In [2]:
df = pd.read_csv('./BA_Project.csv', encoding= 'unicode_escape')
df.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
0,1,10123411,20012001,AAA AAA1,,81.82,,91.55,87.72,,...,,,,,,,,,,83.87
1,2,10123412,20012002,AAA AAA2,93.33,90,,77.19,86.21,,...,,,,100,,86.67,,81.97,,85.56
2,3,10123413,20012003,AAA AAA3,71.11,76.67,,75.44,74.14,,...,,,,,,86.67,,75.41,,77.56
3,4,10123414,20012004,AAA AAA4,,78.79,,81.69,85.96,,...,,,,,,,,,,84.79
4,5,10123415,20012005,AAA AAA5,,78.79,,85.92,82.46,,...,,,,,,,,,,84.56

### Making a list column with the names of all the columns

In [3]:
columns = [i.replace('\xa0','') for i in df.columns]

In [4]:
del columns[:4]

### Replacing the empty values with 0

In [5]:
df = df.replace(r'^\s*$', 0, regex=True)
df.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
0,1,10123411,20012001,AAA AAA1,0,81.82,0,91.55,87.72,0,...,0,0,0,0,0,0,0,0,0,83.87
1,2,10123412,20012002,AAA AAA2,93.33,90,0,77.19,86.21,0,...,0,0,0,100,0,86.67,0,81.97,0,85.56
2,3,10123413,20012003,AAA AAA3,71.11,76.67,0,75.44,74.14,0,...,0,0,0,0,0,86.67,0,75.41,0,77.56
3,4,10123414,20012004,AAA AAA4,0,78.79,0,81.69,85.96,0,...,0,0,0,0,0,0,0,0,0,84.79
4,5,10123415,20012005,AAA AAA5,0,78.79,0,85.92,82.46,0,...,0,0,0,0,0,0,0,0,0,84.56

### Removing the white spaces in column names

In [6]:
df = df.rename(columns=lambda x: x.strip())

### Removing spaces between elements in columns

In [7]:
for col in columns:
    if df[col].dtype == 'object':
        df[col] = df[col].str.strip()

### Converting columns type from 'object' to 'numeric'

In [8]:
for col in columns:
    df[col] = df[col].apply(pd.to_numeric)
df.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
0,1,10123411,20012001,AAA AAA1,NaN,81.82,NaN,91.55,87.72,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,83.87
1,2,10123412,20012002,AAA AAA2,93.33,90.00,NaN,77.19,86.21,NaN,...,NaN,NaN,NaN,100.0,NaN,86.67,NaN,81.97,NaN,85.56
2,3,10123413,20012003,AAA AAA3,71.11,76.67,NaN,75.44,74.14,NaN,...,NaN,NaN,NaN,NaN,NaN,86.67,NaN,75.41,NaN,77.56
3,4,10123414,20012004,AAA AAA4,NaN,78.79,NaN,81.69,85.96,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.79
4,5,10123415,20012005,AAA AAA5,NaN,78.79,NaN,85.92,82.46,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.56

### Selecting student details that have attendance less than 75% even in one subject. (for Theory)

In [9]:
Theory = columns[:-5]

In [10]:
s = ''
for col in Theory:
    s += (f"(df['{col}'] < 75) | ")
s

"(df['AML3201'] < 75) | (df['CSL2301'] < 75) | (df['CSL3307'] < 75) | (df['CSL4207'] < 75) | (df['CSL4208'] < 75) | (df['CSL4305'] < 75) | (df['CSL4318'] < 75) | (df['CSL4336'] < 75) | (df['CSL5210'] < 75) | (df['CSP2301'] < 75) | (df['ECL3311'] < 75) | (df['GEW1601'] < 75) | (df['GEW1603'] < 75) | (df['GEW1604'] < 75) | (df['GEW1605'] < 75) | (df['GEW1607'] < 75) | (df['GEW1608'] < 75) | (df['GEW1609'] < 75) | (df['GEW1610'] < 75) | (df['GEW1611'] < 75) | (df['GEW1613'] < 75) | "

In [11]:
df1 = df[(df['AML3201'] < 75) | (df['CSL2301'] < 75) | (df['CSL3307'] < 75) | (df['CSL4207'] < 75) | (df['CSL4208'] < 75) | (df['CSL4305'] < 75) | (df['CSL4318'] < 75) | (df['CSL4336'] < 75) | (df['CSL5210'] < 75) | (df['CSP2301'] < 75) | (df['ECL3311'] < 75) | (df['GEW1601'] < 75) | (df['GEW1603'] < 75) | (df['GEW1604'] < 75) | (df['GEW1605'] < 75) | (df['GEW1607'] < 75) | (df['GEW1608'] < 75) | (df['GEW1609'] < 75) | (df['GEW1610'] < 75) | (df['GEW1611'] < 75) | (df['GEW1613'] < 75)]

In [12]:
df1.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
2,3,10123413,20012003,AAA AAA3,71.11,76.67,NaN,75.44,74.14,NaN,...,NaN,NaN,NaN,NaN,NaN,86.67,NaN,75.41,NaN,77.56
6,7,10123417,20012007,AAA AAA7,73.33,76.67,NaN,75.44,75.86,NaN,...,NaN,NaN,NaN,NaN,100.0,80.00,NaN,70.49,NaN,75.78
7,8,10123418,20012008,AAA AAA8,86.67,73.33,NaN,77.19,77.59,NaN,...,NaN,NaN,NaN,100.0,NaN,73.33,NaN,73.77,NaN,78.67
10,11,10123421,20012011,AAA AAA11,86.67,86.67,NaN,73.68,84.48,NaN,...,NaN,NaN,NaN,NaN,NaN,80.00,NaN,77.05,NaN,82.22
13,14,10123424,20012014,AAA AAA14,75.56,73.33,NaN,73.68,74.14,NaN,...,100.0,NaN,NaN,NaN,NaN,66.67,NaN,68.85,NaN,74.00

### Selecting student details that have attendance less than 75% even in one subject. (for Practical)

In [13]:
Practical = columns[-5:-1]

In [14]:
s = ''
for col in Practical:
    s += (f"(df['{col}'] < 75) | ")
s

"(df['AMP1201'] < 75) | (df['CSP1307'] < 75) | (df['CSP2210'] < 75) | (df['ECP1311'] < 75) | "

In [15]:
df2 = df[(df['AMP1201'] < 75) | (df['CSP1307'] < 75) | (df['CSP2210'] < 75) | (df['ECP1311'] < 75)]

In [16]:
df2.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
6,7,10123417,20012007,AAA AAA7,73.33,76.67,NaN,75.44,75.86,NaN,...,NaN,NaN,NaN,NaN,100.0,80.00,NaN,70.49,NaN,75.78
7,8,10123418,20012008,AAA AAA8,86.67,73.33,NaN,77.19,77.59,NaN,...,NaN,NaN,NaN,100.0,NaN,73.33,NaN,73.77,NaN,78.67
9,10,10123420,20012010,AAA AAA10,82.22,76.67,NaN,80.70,82.76,NaN,...,NaN,NaN,NaN,NaN,NaN,80.00,NaN,73.77,NaN,80.67
13,14,10123424,20012014,AAA AAA14,75.56,73.33,NaN,73.68,74.14,NaN,...,100.0,NaN,NaN,NaN,NaN,66.67,NaN,68.85,NaN,74.00
21,22,10123432,20012022,AAA AAA22,71.11,76.67,NaN,70.18,68.97,NaN,...,NaN,NaN,NaN,NaN,NaN,73.33,NaN,72.13,NaN,74.00

### Making new file "Make up list Theory.csv" for students with attendance less than 75%. (for Theory)

In [17]:
df1.to_csv('Make_Up_List_Theory.csv')

### Making new file "Make up list Practical.csv" for students with attendance less than 75%. (for Practical)

In [18]:
df2.to_csv('Make_Up_List_Practical.csv')

### Making new file "Attendance_OK" for students with attendance greater than 75%.

In [19]:
df3 = df[~df.index.isin(df1.index)]

In [20]:
df_new = df3[~df3.index.isin(df2.index)]

In [21]:
df_new.head()

,Serial Number,Roll_Num,Uni_ID,Student Name,AML3201,CSL2301,CSL3307,CSL4207,CSL4208,CSL4305,...,GEW1608,GEW1609,GEW1610,GEW1611,GEW1613,AMP1201,CSP1307,CSP2210,ECP1311,Total
0,1,10123411,20012001,AAA AAA1,NaN,81.82,NaN,91.55,87.72,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,83.87
1,2,10123412,20012002,AAA AAA2,93.33,90.00,NaN,77.19,86.21,NaN,...,NaN,NaN,NaN,100.0,NaN,86.67,NaN,81.97,NaN,85.56
3,4,10123414,20012004,AAA AAA4,NaN,78.79,NaN,81.69,85.96,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.79
4,5,10123415,20012005,AAA AAA5,NaN,78.79,NaN,85.92,82.46,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,84.56
5,6,10123416,20012006,AAA AAA6,84.44,83.33,NaN,75.44,86.21,NaN,...,NaN,NaN,NaN,100.0,NaN,86.67,NaN,77.05,NaN,82.22

In [22]:
df_new.to_csv('Attendance_OK.csv')